Following up, I have a similar case with two more maps (load balancer backend set):

`session-persistence-configuration` and `ssl-configuration` are not set:
```js
$ oci lb load-balancer list
{
  "data": [
    {
      "backend-sets": {
        "bs_lb_2019-0613-1444": {
          "backends": [
            {
              "backup": false,
              "drain": false,
              "ip-address": "x.x.x.3",
              "name": "x.x.x.3:80",
              "offline": false,
              "port": 80,
              "weight": 1
            },
            {
              "backup": false,
              "drain": false,
              "ip-address": "x.x.x.4",
              "name": "x.x.x.4:80",
              "offline": false,
              "port": 80,
              "weight": 1
            }
          ],
          "health-checker": {
            "interval-in-millis": 100000,
            "port": 80,
            "protocol": "HTTP",
            "response-body-regex": "",
            "retries": 3,
            "return-code": 200,
            "timeout-in-millis": 3000,
            "url-path": "/"
          },
          "name": "bs_lb_2019-0613-1444",
          "policy": "ROUND_ROBIN",
          "session-persistence-configuration": null,
          "ssl-configuration": null
        }
      },
      "certificates": {},
      "compartment-id": "ocid1.compartment.oc1..(...)d3ta",
      "defined-tags": {},
      "display-name": "XXX",
      "freeform-tags": {},
      "hostnames": {},
      "id": "ocid1.loadbalancer.oc1.uk-london-1.(...)3zq",
      "ip-addresses": [
        {
          "ip-address": "x.x.x.8",
          "is-public": false
        }
      ],
      "is-private": true,
      "lifecycle-state": "ACTIVE",
      "listeners": {
        "listener_lb_2019-0613-1444": {
          "connection-configuration": {
            "idle-timeout": 60
          },
          "default-backend-set-name": "bs_lb_2019-0613-1444",
          "hostname-names": null,
          "name": "listener_lb_2019-0613-1444",
          "path-route-set-name": null,
          "port": 80,
          "protocol": "HTTP",
          "rule-set-names": [],
          "ssl-configuration": null
        }
      },
      "path-route-sets": {},
      "rule-sets": {},
      "shape-name": "100Mbps",
      "subnet-ids": [
        "ocid1.subnet.oc1.uk-london-1.(...)z3q"
      ],
      "time-created": "2019-06-13T13:46:33.812000+00:00"
    }
  ]
}
```

They aren't set in the resource either:

```hcl
resource "oci_load_balancer_backend_set" "xxx_lb-backend-set" {
  #Required
  load_balancer_id = oci_load_balancer_load_balancer.xxx_lb.id
  name             = "bs_lb_2019-0613-1444"
  policy           = "ROUND_ROBIN"

  health_checker {
    #Required
    protocol = "HTTP"

    #Optional
    port                = 80
    retries             = 3
    interval_ms         = 100000
    timeout_in_millis   = 3000
    return_code         = 200
    url_path            = "/"
    response_body_regex = ""
  }
}
```

Yet they are flagged for change:

```js
Terraform will perform the following actions:

  # oci_load_balancer_backend_set.xxx_lb-backend-set will be updated in-place
  ~ resource "oci_load_balancer_backend_set" "xxx_lb-backend-set" {
        backend          = [
            {
                backup     = false
                drain      = false
                ip_address = "x.x.x.3"
                name       = "x.x.x.3:80"
                offline    = false
                port       = 80
                weight     = 1
            },
            {
                backup     = false
                drain      = false
                ip_address = "x.x.x.4"
                name       = "x.x.x.4:80"
                offline    = false
                port       = 80
                weight     = 1
            },
        ]
        id               = "loadBalancers/ocid1.loadbalancer.oc1.uk-london-1.(...)3zq/backendSets/bs_lb_2019-0613-1444"
        load_balancer_id = "ocid1.loadbalancer.oc1.uk-london-1.(...)3zq"
        name             = "bs_lb_2019-0613-1444"
        policy           = "ROUND_ROBIN"

        health_checker {
            interval_ms       = 100000
            port              = 80
            protocol          = "HTTP"
            retries           = 3
            return_code       = 200
            timeout_in_millis = 3000
            url_path          = "/"
        }

      + session_persistence_configuration {
          + cookie_name      = (known after apply)
          + disable_fallback = (known after apply)
        }

      + ssl_configuration {
          + certificate_name        = (known after apply)
          + verify_depth            = (known after apply)
          + verify_peer_certificate = (known after apply)
        }

        timeouts {}
    }
```

Can I assume this will also be fixed once you rebuild the provider with the latest SDK?